<html>
<head>
<TITLE>LUGT Installationsschau 98 - Installation</TITLE>
</head>
<body bgcolor="#FFFFFF" link="#dd0000" vlink="aa0000" text="#000000">
<center>
<TABLE border=0 cellspacing=0 cellpadding=0 width=100%><TR>
<TD width=10%>&nbsp;</TD>
<TD rowspan=3 width=1% align=center valign=0><IMG src=./sau.gif alt="Sau"></TD>
<TD width=89%>&nbsp;</TD></TR><TR><TD width=10% bgcolor="#CCCCCC">&nbsp;</TD>
<TD align=center valign=middle bgcolor="#CCCCCC">
<FONT size=+2 face=arial,helvetica><B>&nbsp;Linux Installationsschau 98&nbsp;</B></FONT>
</TD></TR><TR><TD width=10%>&nbsp;</TD><TD width=90%>&nbsp;</TD>
</TR></TABLE><P>
<FONT size=+3 face=arial,helvetica>Installation</FONT>
</CENTER><p align=left>
<FONT  face=arial,helvetica>Die Erstinstallation von Linux legt den
Grundstein f&uuml;r die gesamte weitere Arbeit mit dem
System und sollte daher besonders gr&uuml;ndlich geplant werden. Zu den
wichtigsten Punkten z&auml;hlen dabei:
<P>
<DL>
<DT><B>Auswahl der Distribution.</B>
<DD>Egal ob Red Hat, SuSE oder Debian - Linux bleibt zuallererst einmal
Linux. Das hei&szlig;t, die Funktionalit&auml;t bleibt dieselbe, nur die
&raquo;Verpackung&laquo; &auml;ndert sich. W&auml;hrend die wichtigsten
Softwarepakete in allen Distributionen nahezu identisch vorhanden sind,
unterscheiden sie sich zum Teil recht deutlich im Bedienkomfort. Programme
zum Installieren, Konfigurieren und Verwalten von neuen Programmpaketen
sowie zur Systemadministration sind meist distributionsspezifisch und
sollten daher f&uuml;r den Einsteiger das wichtigste Kriterium f&uuml;r oder
gegen eine Distribution sein.
<DT><B>Partitionieren der Festplatte(n).</B>
<DD>Das ist der wohl kritischste Schritt bei einer Neuinstallation, da er
nachtr&auml;glich kaum mehr zu &auml;ndern ist. Sicherheitsaspekte legen
eine Aufteilung des Systems auf m&ouml;glichst viele Partitionen nahe.
Allerdings kann eine zu klein gew&auml;hlte Partition langfristig die
Ausbaum&ouml;glichkeiten eines Systems stark einschr&auml;nken.
<DT><B>Unterst&uuml;tzung von Zusatzhardware.</b>
<DD>Unter Linux kann praktisch jede g&auml;ngige PC-Hardware betrieben
werden, von der TV-Karte bis zum magneto-optischen Laufwerk. Wichtig ist
jedoch eine m&ouml;glichst genaue Dokumentation - typischerweise m&uuml;ssen
bei der Installation verschiedene Werte f&uuml;r IRQs, DMA-Kan&auml;le etc.
angegeben werden. Es sollten also nach M&ouml;glichkeit alle Handb&uuml;cher
und Datenbl&auml;tter in Reichweite sein.
<DT><B>Anpassen des Kernels.</B>
<DD>Mit jeder Distribution werden einer oder mehrere Linux-Kernel geliefert.
Sie lassen sich auch zumeist problemlos f&uuml;r die weitere Arbeit
verwenden. Allerdings handelt es sich dabei gewisserma&szlig;en um
&raquo;Allround&laquo;-Kernel, die auf sehr vielen unterschiedlichen
Systemen lauff&auml;hig sind. Dadurch enthalten sie aber auch eine Vielzahl
von Komponenten, die auf dem eigenen System nicht gebraucht werden. Statt
dessen kann man einen eigenen Kernel erstellen, der exakt auf die lokalen
Bed&uuml;rfnisse zugeschnitten ist. Das erfordert zwar ein wenig Handarbeit,
der Kernel ist dann aber in der Regel schlanker und schneller.
<DT><B>Installieren zus&auml;tzlicher Software.</B>
<DD>Neben einer Sammlung der unbedingt notwendigen Programme werden die
meisten Distributionen mit einer kaum &uuml;berschaubaren Anzahl an
Zusatzsoftware ausgeliefert. Distributionsspezifische Tools helfen, bei der
Verwaltung nicht den &Uuml;berblick zu verlieren. Hier mu&szlig;
zwangsl&auml;ufig ein Kompromi&szlig; geschlossen werden zwischen einfacher
Bedienung und Flexibilit&auml;t. 
</DL>
<P>
Bei diesen und allen weiteren Fragen, die im Laufe einer Installation
auftauchen k&ouml;nnen, werden Sie von Fachleuten der LUGT beraten.
Au&szlig;erdem erhalten Sie Tips, wie Sie anschlie&szlig;end Ihr System ohne
fremde Hilfe verwalten und in einem gepflegten Zustand halten.  
</body>
</html>

