<html>
<head>
<TITLE>LUGT Installationsschau 98 - Presse</TITLE>
</head>
<body bgcolor="#FFFFFF" link="#dd0000" vlink="aa0000" text="#000000">
<center>
<TABLE border=0 cellspacing=4><TR>
<TD rowspan=2><IMG src=../pics/penguin_m.gif alt="Pingu"></TD>
<TD align=center valign=middle>
<FONT size=+3><B>Linux User Group T&uuml;bingen</B></FONT>
</TD></TR><TR><TD><TABLE><TR>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<nobr><A HREF="../index.html"><b>Wir &uuml;ber uns</b></A>&nbsp;</nobr></TD>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<A HREF="../linuxger.html"><nobr><b>Linux in Deutschland</b></A>&nbsp;</nobr></TD>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<A HREF="../linuxworld.html"><nobr><b>Linux weltweit</b></A>&nbsp;</nobr></TD>
</TR></TABLE></TD></TR></TABLE>
<p></CENTER>
<TABLE border=0 cellspacing=0 width=80%><TR>
<TD bgcolor=#FFE794 width=36%>
<NOBR>&nbsp;<B>P<font size=-1>RESSEMITTEILUNG</font></b></NOBR>
</TD>
<TD bgcolor=#FFEAA1 width=8%>&nbsp;</TD>
<TD bgcolor=#FFEDAD width=8%>&nbsp;</TD>
<TD bgcolor=#FFF0B7 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF3C4 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF6D5 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF9DD width=8%>&nbsp;</TD>
<TD bgcolor=#FFFCF2 width=8%>&nbsp;</TD>
<TD bgcolor=#FFFFFF width=8%>&nbsp;</TD>
</TR></TABLE><P align=justify>
<FONT face="arial, helvetica">
<B>Finnische Frischzellenkur</B> von Daniel Kobras<P>

T&uuml;binger Linux-User bringen PC auf Touren
<P align=justify>
(dk). Unkomfortable Bedienung, triste Optik und kryptische Befehle -
das Computerbetriebssystem UNIX &uuml;bte lange Jahre auf unbedarfte Nutzer
nicht mehr Reiz aus als eine Steuererkl&auml;rung. Von hartgesottenen
Computerfreaks f&uuml;r ihresgleichen geschrieben, war es zwar &auml;u&szlig;erst
leistungsf&auml;hig, aber auch ebenso kompliziert. Doch die Zeiten &auml;ndern
sich: Mit der UNIX-Variante Linux steht inzwischen ein
Betriebssystem zur Verf&uuml;gung, das auch dem heimischen PC das Optimum
an Leistung zu entlocken vermag und dennoch einfach zu bedienen
ist. Am Samstag,
den 9. Mai bietet die Linux User Group T&uuml;bingen Einblicke und
handfeste Hilfestellungen bei den ersten Schritten in die neue Computerwelt.
<P align=justify>
Als der finnische Informatikstudent Linus Torvalds vor sieben Jahren
die erste Version seines Betriebssystems Linux fertigstellte, hatte er
kein kommerzielles
Interesse im Sinn; es war im Grunde nicht mehr als ein Studienobjekt,
eine Finger&uuml;bung. Dem Internet ist es zu verdanken, da&szlig; zahlreiche
Programmierer weltweit das Projekt aufgriffen und gemeinsam immer
weiter verbesserten. Das Resultat ist ein Betriebssystem, das die
PC-Hardware bis an die Grenze ihrer Leistungsf&auml;higkeit
ausreizt. Verbreitet ist es deshalb vor allem an Universit&auml;ten, wenn
viel Rechenleistung zum kleinen Preis gefragt ist. Denn wer Linux
benutzt, mu&szlig; nicht tief in die Tasche greifen. Via Internet sind das
Betriebssystem und zahllose Anwendungsprogramme kostenlos zu haben,
ausf&uuml;hrlich dokumentierte Versionen auf CD-ROM gibt es in der Regel
f&uuml;r zweistellige Betr&auml;ge.
<P align=justify>
Achillesferse von Linux war lange die nahe Verwandtschaft zum auf den
ersten Blick un&uuml;bersichtlichen UNIX. In letzter Zeit jedoch
konzentrieren sich mehr und mehr Softwareentwickler darauf, dem
Betriebssystem ein freundliches Gesicht zu verleihen. Graphische
Oberfl&auml;chen statt vertrackter Textzeilen machen Linux zu einer echten
Alternative, sowohl f&uuml;r den B&uuml;rocomputer wie f&uuml;r den Rechner
daheim. Den n&ouml;tigen Leistungsumfang besitzt Linux seit langem:
Netzwerk- und Internetf&auml;higkeit geh&ouml;ren zum Standardumfang, Software
vom Musikprogramm bis zum Office-Paket wurde teils aus dem
UNIX-Bereich &uuml;bertragen, teils eigens f&uuml;r Linux entwickelt. Ein
weiterer Pluspunkt ist das Thema Sicherheit. W&auml;hrend beispielsweise
das weit
verbreitete Windows in j&uuml;ngster Zeit wiederholt durch
erfolgreiche Internet-Attacken von Hackern in die Schlagzeilen
geriet, gilt Linux ebenso wie UNIX in dieser Hinsicht als
au&szlig;erordentlich robust. 
<P align=justify>
Die Linux User Group T&uuml;bingen (LUGT) wird diese und noch mehr
Vorz&uuml;ge des Betriebssystems im Rahmen einer Installationsschau am
9. Mai im Botanischen Institut (Auf der Morgenstelle 1, T&uuml;bingen)
ab 10 Uhr
vorf&uuml;hren. Demonstriert werden unter anderem verschiedene
Internetdienste, graphische Benutzeroberfl&auml;chen oder die Vernetzung mit
Rechnern anderer Betriebssysteme. Erfahrene LUGT-Mitglieder helfen
bei den ersten Schritten hin zu Linux oder geben Tips
zur optimalen Konfiguration. Wer will, kann sich Linux vor Ort auf
seinem Computer installieren lassen. Dazu ist es jedoch erforderlich,
sich vorab anzumelden unter der Telefonnummer 07071-760&nbsp;283, via E-Mail
instschau98@tuebingen.linux.de, im WWW unter http://www.tuebingen.linux.de/instschau98/
oder als Fax unter 07129-932&nbsp;726.
</FONT><P><br>
<hr size=1 noshade>
<CENTER>
<A HREF="index.html">Home</A>
<A HREF="announce.html">Announce</A>
<A HREF="wall.html">WSJ-Artikel</A>
</CENTER>
<hr size=2 noshade>
<TABLE width=100%><TR><TD align=right><font size=-1><i>Letzte &Auml;nderungen am 18.04.98<BR>
von <A href="mailto:dirk.staneker@student.uni-tuebingen.de">Dirk 
Staneker</A></TD></TR></TABLE>
</TR></TD></TABLE></CENTER>
</body>
</html>

