<html>
<head>
<TITLE>LUGT Installationsschau 98 - Von h&ouml;herer Stelle</TITLE>
</head>
<body bgcolor="#FFFFFF" link="#dd0000" vlink="aa0000" text="#000000">
<center>
<TABLE border=0 cellspacing=4><TR>
<TD rowspan=2><IMG src=../pics/penguin_m.gif alt="Pingu"></TD>
<TD align=center valign=middle>
<FONT size=+3><B>Linux User Group T&uuml;bingen</B></FONT>
</TD></TR><TR><TD><TABLE><TR>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<nobr><A HREF="../index.html"><b>Wir &uuml;ber uns</b></A>&nbsp;</nobr></TD>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<A HREF="../linuxger.html"><nobr><b>Linux in Deutschland</b></A>&nbsp;</nobr></TD>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<A HREF="../linuxworld.html"><nobr><b>Linux weltweit</b></A>&nbsp;</nobr></TD>
</TR></TABLE></TD></TR></TABLE>
<p></CENTER>
<TABLE border=0 cellspacing=0 width=80%><TR>
<TD bgcolor=#FFE794 width=36%>
<NOBR>&nbsp;<B>V<font size=-1>ON H&Ouml;HERER STELLE</font></b></NOBR>
</TD>
<TD bgcolor=#FFEAA1 width=8%>&nbsp;</TD>
<TD bgcolor=#FFEDAD width=8%>&nbsp;</TD>
<TD bgcolor=#FFF0B7 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF3C4 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF6D5 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF9DD width=8%>&nbsp;</TD>
<TD bgcolor=#FFFCF2 width=8%>&nbsp;</TD>
<TD bgcolor=#FFFFFF width=8%>&nbsp;</TD>
</TR></TABLE>
<P align=justify>
<FONT face="arial, helvetica">
[Aus "The Wall Street Journal" vom 3. April 1998, Seite B7B]<BR>
[&uuml;bersetzt von Daniel Kobras]<BR>
<P align=justify>
<B>Linux spielt mit in "Titanic", bei Fotos der NASA, aber kann Linux es mit
Microsoft aufnehmen?</B>
<P align=justify>

Von Sean Davis<BR>
Dow Jones Newswire
<P align=justify>
NEW YORK - Die Macher von "Titanic" haben es benutzt, um die Spezialeffekte
des Filmhits zu berechnen. Die NASA benutzt es, um Bilder von der Erde
zusammenzusetzen. Es ist frei erh&auml;ltlich f&uuml;r jeden, der es will, aber
wenigstens zwei Firmen verkaufen es.
<P align=justify>
Die Frage: Was ist Linux?
<P align=justify>
Linux ist ein Betriebssystem, wie Microsofts Windows. Aber im Gegensatz zu
Windows gibt es niemanden, dem Linux geh&ouml;rt. Und sein Quellcode - die
Befehlsketten, die die Entwickler benutzen, um Linux zu erzeugen - ist frei
erh&auml;ltlich.
<P align=justify>
Linux-Bef&uuml;rworter vertreten daher die Ansicht, da&szlig; die Software gute Chancen
besitzt, Windows NT Marktanteile zu entrei&szlig;en. Windows NT ist die
Unternehmensversion des marktf&uuml;hrenden Microsoft-Betriebssystems, gedacht f&uuml;r
den Einsatz am Arbeitsplatz. Ein kommerzieller Linux-Anbieter, Red Hat
Software Inc., sch&auml;tzt seinen Absatz dieses Jahr auf 400 000 Kopien zum
St&uuml;ckpreis von 50 Dollar.
<P align=justify>
Die Geschichte des heute als Linux bekannten Betriebssystems nahm ihren
Anfang im Jahr 1983. Richard Stallman, damals Programmierer in der Abteilung
f&uuml;r K&uuml;nstliche Intelligenz am Massachusetts Institute of Technology, begann
an einer freien Alternative zu Unix zu arbeiten, dem Betriebssystem, das in
den Bell Labors der Telefongesellschaft AT&T entwickelt worden war.
<P align=justify>
Stallman taufte sein Betriebssystem GNU, was f&uuml;r "Gnu's Not Unix" - "Gnu ist
Nicht Unix" - steht. (Die Abk&uuml;rzung in der Abk&uuml;rzung ist laut Stallman eine
alte Tradition in Softwareentwicklerkreisen. Er nennt es "Hacker-Humor".)
Durch die Arbeit von Stallman und anderen wuchs GNU St&uuml;ck um St&uuml;ck, doch
1991 fehlte noch ein essentieller Teil: der Kern, der das Betriebssystem zum
Laufen bringt. 
<P align=justify>
Hier nun kommt Linux' Namensgeber ins Spiel. Linus Torvalds, damals Student
an der Universit&auml;t von Helsinki, schrieb den Betriebssystemkern, benannte
ihn nach sich selbst und ver&ouml;ffentlichte ihn unter der GNU Lizenz. (Torvalds
arbeitet inzwischen f&uuml;r die erfolgreiche kalifornische Softwarefirma
Transmeta in Santa Clara, zu deren Investoren auch der Microsoft-Mitbegr&uuml;nder
Paul Allen z&auml;hlt.)
<P align=justify>
Die GNU Lizenz GPL ist ein weiteres Stallman-Kind. 1985 zum erstenmal
niedergeschrieben und zweimal - zuletzt 1991 - &uuml;berarbeitet, erlaubt sie
jedermann, Linux - oder GNU/Linux, wie das Betriebssystem auch bekannt ist -
zu benutzen. Lizenznehmer m&uuml;ssen demnach nachfolgenden Nutzern den Quellcode
zur Verf&uuml;gung stellen, selbst wenn sie ihre Software f&uuml;r Geld vertreiben,
wie es ebenfalls erlaubt ist. Und Nutzer m&uuml;ssen zustimmen, da&szlig; sie s&auml;mtliche
&Auml;nderungen und Verbesserungen am Betriebssystem als Quellcode &ouml;ffentlich
zug&auml;nglich machen.
<P align=justify>
Das bedeutet, da&szlig; eine durch das Internet verbundene Gemeinde von Hackern
und Softwareentwicklern Linux st&auml;ndig erweitert und verbessert. Das
Betriebssystem, wie es heute existiert, ist eine lose umrissene Sammlung von
Reparaturen und Weiterentwicklungen, m&ouml;glich gemacht, durch die GNU Lizenz.
<P align=justify>
Aber freie Software hei&szlig;t nicht kostenlos, und hier kommen die Unternehmen
Red Hat und der Konkurrent Caldera ins Spiel.
<P align=justify>
Red Hat mit Sitz im Research Triange Park in North Carolina holt sich die
aktuelle Version von Linux aus dem Internet und stellt sie zu Paketen
zusammen, die auf CD-ROMs verkauft werden.
<P align=justify>
Red-Hat-Pr&auml;sident und Mitbegr&uuml;nder Robert Young sagt, da&szlig; die Kunden seines
Unternehmens f&uuml;r drei Dinge bezahlen: f&uuml;r den Komfort einer CD, f&uuml;r
technische Beratung und Service sowie f&uuml;r eine verl&auml;&szlig;liche Version des
Betriebssystems. Er erkl&auml;rt, da&szlig; Red Hat - benannt nach einer Sport-M&uuml;tze
des Mitbegr&uuml;nders Marc Ewing - seit seinem Start im Januar 1995 rund 600 000
CDs vertrieben hat. 
<P align=justify>
Caldera, beheimatet in Orem im US-Bundesstaat Utah verfolgt eine etwas
andere Gesch&auml;ftsstrategie. Es erg&auml;nzt Linux um nicht frei erh&auml;ltliche -
propriet&auml;re - Elemente, unter anderem eine bedienungsfreundliche
Benutzeroberfl&auml;che, und verkauft das Paket auf CD-ROM. F&uuml;r die propriet&auml;re
Software mu&szlig; Caldera teilweise Lizenzgeb&uuml;hren an andere Verk&auml;ufer
entrichten; der Quellcode der kommerziellen Programme wird nicht
ver&ouml;ffentlicht.
<P align=justify>
Hinter Caldera steht Ray Noorda, der 1994 seinen Posten als
Novell-Vorsitzender aufgegeben hat. Canopy Group, eine 1995 von Noorda
gegr&uuml;ndete Investmentfirma, ist Calderas einziger Geldgeber, und Caldera
wurde aufgebaut von fr&uuml;heren Novell-Mitarbeitern, die unter Noorda
gearbeitet hatten.
<P align=justify>
Noordas Schulterschlu&szlig; mit Linux ist in der Tat ein weiteres Kapitel seiner
wohlbekannten Rivalit&auml;t zu Microsoft. Zu Beginn der neunziger Jahre hatte
Novell unter Nordaas Vorsitz mit kostspieligen Firmenk&auml;ufen versucht, dem
Softwaregiganten aus Redmond im US-Bundesstaat Washington Paroli zu bieten -
eine Strategie, die inzwischen fallengelassen worden ist.
<P align=justify>
Ob Linux Windows herausfordern kann, ist eine offene Frage. Laut Red Hat
benutzen gesch&auml;tzte f&uuml;nf bis 10,5 Millionen Menschen das Betriebssystem. Dem
gegen&uuml;ber stehen 95 Millionen Kopien von Windows, die Microsoft
voraussichtlich dieses Jahr ausliefern wird.
<P align=justify>
Aber Linux hat einige bemerkenswerte Erfolge vorzuweisen. Beispielsweise
setzte die Spezialeffekte-Firma Digital Domain Red Hats Linux auf
leistungsstarken Computern ein, um die atemberaubenden Bilder der "Titanic"
zu berechnen, unter anderem das eisige Meer, das das Schiff verschluckt.
<P align=justify>
Ein weiterer Nutzer ist die US-Luft- und Raumfahrtbeh&ouml;rde NASA. Als am
Goddard Raumfahrtzentrum in Maryland ein Supercomputer aus handels&uuml;blichen
PC-Teilen zusammengebastelt wurde, entschied man sich, den Zahlenknacker
unter Linux zu betreiben, zum Teil aufgrund der Betriebssystem-Kultur.
<P align=justify>
"In der Linux-Gemeinde gibt es eine richtige Tradition, Teile zu einem gr&ouml;&szlig;eren
Projekt beizutragen", erkl&auml;rte Goddard-Wissenschaftler Donald Becker. "Eine
solche Einstellung macht jedem das Arbeiten einfacher."
<P align=justify>
Gemeinsames Entwickeln und Probleml&ouml;sen machen aus Linux ein flexibles und
ungew&ouml;hnlich stabiles Betriebssystem, argumentieren seine Bef&uuml;rworter. Der
Nachteil ist, so Becker, da&szlig; Linux sich st&auml;ndig ver&auml;ndert und von seinen
Nutzern immer wieder auf den aktuellen Stand gebracht werden mu&szlig;.
<P align=justify>
"Aber die Alternative w&auml;re ein stagnierendes System", sagte er, "also ist das
ein notwendiges &Uuml;bel."
<P align=justify>
Das Modell freier Software, lange Zeit von den kommerziellen
Softwareschmieden stiefm&uuml;tterlich behandelt, steht inzwischen deutlich h&ouml;her
im Kurs. Netscape Communications hat vor kurzem angek&uuml;ndigt, seinen
Web-Browser samt Quelltext freizugeben. Und Apache, der freie, von einem
bunt zusammengew&uuml;rfelten Haufen von Hackern entwickelte Web-Server, liefert
gesch&auml;tzte 45 Prozent aller Web-Seiten weltweit - mehr als irgendein anderer
Server.
</FONT><P><br>
<hr size=1 noshade>
<CENTER>
<A HREF="index.html">Home</A>
<A HREF="announce.html">Announce</A>
<!-- <A HREF="presse.html">Pressemitteilung</A> -->
</CENTER>
<hr size=2 noshade>
<TABLE width=100%><TR><TD align=right><font size=-1><i>Letzte &Auml;nderungen am 20.04.98<BR>
von <A href="mailto:dirk.staneker@student.uni-tuebingen.de">Dirk
Staneker</A></TD></TR></TABLE>
</TR></TD></TABLE></CENTER>
</body>
</html>


