<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//DE">
<!--Converted with LaTeX2HTML 98.1p1 release (March 2nd, 1998)
originally by Nikos Drakos (nikos@cbl.leeds.ac.uk), CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>2. LUGT-Installationsschau - Pressemitteilung</TITLE>
<META NAME="description" CONTENT="PC-Tuning bei 2. Linux-Installationsschau in T&#252;bingen">
<META NAME="keywords" CONTENT="presse">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
</HEAD>
<BODY bgcolor="#FFFFFF" link="#dd0000" vlink="aa0000" text="#000000">
<center>
<TABLE border=0 cellspacing=4><TR>
<TD rowspan=2><IMG src=../pics/penguin_m.gif alt="Pingu"></TD>
<TD align=center valign=middle>
<FONT size=+3><B>Linux User Group T&uuml;bingen</B></FONT>
</TD></TR><TR><TD><TABLE><TR>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<nobr><A HREF="../index.html"><b>Wir &uuml;ber uns</b></A>&nbsp;</nobr></TD>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<A HREF="../linuxger.html"><nobr><b>Linux in Deutschland</b></A>&nbsp;</nobr></TD>
<TD bgcolor="#ffe794" valign=middle>&nbsp;<A HREF="../linuxworld.html"><nobr><b>Linux weltweit</b></A>&nbsp;</nobr></TD>
</TR></TABLE></TD></TR></TABLE>
<p></CENTER>
<TABLE border=0 cellspacing=0 width=80%><TR>
<TD bgcolor=#FFE794 width=36%>
<NOBR>&nbsp;<B>P<font size=-1>RESSEMITTEILUNG</font></b></NOBR>
</TD>
<TD bgcolor=#FFEAA1 width=8%>&nbsp;</TD>
<TD bgcolor=#FFEDAD width=8%>&nbsp;</TD>
<TD bgcolor=#FFF0B7 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF3C4 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF6D5 width=8%>&nbsp;</TD>
<TD bgcolor=#FFF9DD width=8%>&nbsp;</TD>
<TD bgcolor=#FFFCF2 width=8%>&nbsp;</TD>
<TD bgcolor=#FFFFFF width=8%>&nbsp;</TD>
</TR></TABLE><P align=justify>
<FONT face="arial, helvetica">
<B>Linux f&#252;r alle</B> von Daniel Kobras<P>

PC-Tuning bei 2. Linux-Installationsschau in T&#252;bingen
<P align=justify>
T<SMALL>&#220;BINGEN</SMALL> (dk). 
<B>Jahrelang schien der Computermarkt f&#252;r wenig
&#220;berraschungen gut. Microsoft beherrschte mit seinen 
Windows-Betriebssystemen unangefochten die Szene. Doch seit vor einigen
Monaten Beh&#246;rden und Konkurrenten die Hatz auf den Software-Riesen 
er&#246;ffneten, beginnt dessen Vormachtstellung zu br&#246;ckeln. Einer der
gr&#246;&#223;ten Nutznie&#223;er k&#246;nnte Linux sein, ein freies Betriebssystem, das
von einer gro&#223;en Gemeinde Freiwilliger im Internet entwickelt
wird. Mehrere hundert Interessierte hatten sich vor einem halben Jahr 
bei der ersten Installationsschau der Linux User Group T&#252;bingen (LUGT) &#252;ber
die Vorz&#252;ge von Linux informiert oder sich das Betriebssystem gleich auf
dem eigenen Rechner installieren lassen. Grund genug f&#252;r die Organisatoren, 
die Veranstaltung nun zu wiederholen. Am 14. November sind von 10 bis 18 Uhr
im Botanischen Institut der Uni T&#252;bingen zahlreiche Ausstellungen und 
Vortr&#228;ge und Workshops rund um das Thema Linux geboten. Und 
selbstverst&#228;ndlich bietet die Linux User Group wieder Installationshilfe
f&#252;r Einsteiger.
</B>
<P align=justify>
Das Computer-Betriebssystem Linux hat seinen Weg in
den breiten Markt gefunden. Einst durch seine Verwandtschaft zum 
Betriebssystem-,,Gro&#223;vater`` UNIX auf hartgesottene Spezialisten und Hacker
beschr&#228;nkt, verwenden heute gesch&#228;tze zehn Millionen Menschen weltweit
Linux auf Computern in Heim und B&#252;ro, mit stark steigender Tendenz. Und 
nicht nur die Anwender, auch mehr und mehr renommierte Softwarefirmen nehmen
Linux inzwischen ernst, als professionelle Alternative zu etablierten 
Betriebssystemen. Zu den Vorreitern z&#228;hlen dabei der Datenbank-Spezialist
Oracle und Corel, bekannt durch Standardanwendungen wie Corel Draw und
Word Perfect. Beide wollen in K&#252;rze Linux-Versionen ihrer Programme auf den
Markt bringen. Sozusagen den endg&#252;ltigen Ritterschlag erhielt Linux 
schlie&#223;lich vor wenigen Wochen, als der marktf&#252;hrende Chipproduzent Intel 
seine offizielle Unterst&#252;tzung bekanntgab.

<P align=justify>
,,Noch ist Linux sicher nicht das alleinige Patentrezept, das Betriebssystem
f&#252;r jedermann``, so Dirk Staneker von der Linux User Group T&#252;bingen, 
,,aber es ist sicher eine Alternative, die jeder ernsthafte Anwender
kennen sollte.`` Das gelte vor allem, da immer mehr PCs an Firmennetze oder
ans Internet angeschlossen seien - ein Bereich, in dem Linux seine gr&#246;&#223;ten
Vorz&#252;ge ausspielen k&#246;nne. Hohe Stabilit&#228;t und Sicherheit sowie die 
F&#228;higkeit, problemlos mit anderen Betriebssystemen Daten auszutauschen,
pr&#228;destinierten Linux f&#252;r den Einsatz gerade in kleinen und 
mittelst&#228;ndischen Betrieben. Linux im professionellen Einsatz sei einer der
Schwerpunkte der 2. Installationsschau der LUGT, nicht nur im 
Ausstellungsteil, sondern auch in Vortr&#228;gen zu Themen wie Netzwerksicherheit
oder der Arbeit mit Office-Paketen. Daneben steht auch ein Workshop ,,Linux
im Intranet`` auf dem Programm. Da&#223; Linux selbst vor gr&#246;&#223;ten Datenmengen
nicht kapituliert, wird gezeigt am Stand des Zentrums f&#252;r Datenverarbeitung
der Uni T&#252;bingen, das einen Gro&#223;teil seiner Rechner inzwischen unter Linux
betreibt. ,,Aber wir wollen die Leute nicht einfach zu Linux k&#246;dern und sie
dann im Regen stehen lassen``, erkl&#228;rt Staneker. ,,Wir bieten auch eine
Menge Hilfestellungen f&#252;r Einsteiger und Neulinge, angefangen davon, da&#223;
wir Linux auf mitgebrachten Rechnern installieren, bis hin zu Vortr&#228;gen
&#252;ber die ersten Schritte mit Linux, und wie man sich sp&#228;ter alleine
zurechtfinden kann.`` Wer seinen Rechner zur Installation mitbringen will,
mu&#223; sich allerdings zuvor anmelden unter der Telefonnummer (07071)
760283 oder via E-Mail an instschau98@tuebingen.linux.de. Weitere 
Informationen gibt es unter http://www.tuebingen.linux.de.
</FONT><P><br>
<hr size=1 noshade>
<CENTER>
<A HREF="index.html">Home</A>
<A HREF="announce.html">Announce</A>
</CENTER>
<hr size=2 noshade>
<TABLE width=100%><TR><TD align=right><font size=-1><i>Letzte &Auml;nderungen
am 05.11.98<BR>
von <A href="mailto:daniel.kobras@student.uni-tuebingen.de">Daniel
Kobras</A></TD></TR></TABLE>
</TR></TD></TABLE></CENTER>



</BODY>
</HTML>
